Repository: toml-f/toml-f
Catalog: doc/locales/*/LC_MESSAGES/how-to.po
Languages: de

source: Staring with the root of the table which is read in the *simulation_input* there are two ways to obtain access to a subtable, first we get the *hamiltonian* subtable, which we defined as mandatory, using the ``get_value`` interface. In case it is present a reference will be returned in the *child* pointer. If no table is available in the input TOML Fortran will insert it into the root table and return the reference to the newly created table. The *child* pointer can still be unassigned in case invalid input is provided, which will result in raising an error in the implementation shown below.
de: Mit dem Wurzelknoten der Tabelle, der in den Datentypen *simulation_input* gelesen wird, gibt es zwei Wege, eine Untertabelle abzufragen, zunächst wird die *hamiltonian* Untertabelle abgefragt, die als benötigt definiert ist und mit der ``get_value``-Schnittstelle abgefragt wird. In Fällen, wenn diese Tabelle vorhanden ist, wird eine Referenz mit dem *child* Zeiger zurückgegeben. Falls keine Tabelle vorhanden ist, wird sie in den Wurzelknoten eingefügt und eine Referenz zurückgegeben. Der *child* Zeiger kann in Fällen von unzulässigen Eingaben nicht zugewiesen werden, was mit einer Fehlermeldung in der Implementierung abgefangen wird.

source: The alternative is to explicitly mark the subtable as optional, like for the *analysis* table, if no table is available or the entry is invalid the *child* pointer will not be assigned. To differentiate those cases we can request the status information, check whether the operation was successful, and cleanly handle the error case.
de: Alternativ kann die Untertabelle als optional markiert werden, wie für die *analysis* Tabelle, wenn keine Tabelle vorhanden ist oder der Eintrag ungültig ist, bleibt der *child* Zeiger unzugewiesen. Um diese Fälle zu unterscheiden, kann der Statusinformationen abgefragt werden, um zu prüfen, ob die Operation erfolgreich war, und im Fall eines Eingabefehlers eine Fehlermeldung ausgegeben wird.

source: The same happens for reading the *hamiltonian_input* and *dftb_input* entry.
de: Das gleiche gilt für die *hamiltonian_input* und *dftb_input* Einträge.

source: Finally, we can implement reading the terminal subtables into the *scc_input*, *skf_input*, and *analysis_input*, where we retrieve the actual values using the ``get_value`` interface. Note that we can conveniently define default values using the ``get_value`` interface. For proper error handling we can retrieve add the optional *stat* argument as well.
de: Zuletzt können die terminalen Untertabellen in *scc_input*, *skf_input*, und *analysis_input* gelesen werden, wo die Werte mit ``get_value`` abgefragt werden. Zusätzlich kann ein Standardwert mit ``get_value`` definiert werden. Für einen korrekten Fehlerbehandlung kann auch der optionalen *stat*-Parameter abgefragt werden.

source: For the small incomplete input as shown here the fine grained substructure seems like overengineered, and could be fully defined in the reading routine for the document root as well. However, for larger program inputs such structure can help to ensure that input readers are properly modular and reusable.
de: F[r das minimale Eingabebeispiel hier ist die Struktur scheinbar zu fein eingeteilt und könnte direkt beim Lesen der Dokumentenwurzel definiert werden. Allerdings bietet diese Struktur für große Programme einen wesentlichen Vorteil, da sie die Einlese-Routinen modular und wiederverwendbar gestaltet sind.

source: The allocation status of a component of derived can used instead of a separate boolean flag to indicate whether a feature should be activated. This avoids requiring conditional code inside a reader routine for conditionally handling entries depending on a boolean flag, instead they can be collected in a subtable.
de: Der Allokationsstatus der Teilkomponenten in den Datentypen kann statt eines separated logischen Option verwendet werden, um eine aktive Funktionalität zu signalisieren. Dies ermöglicht es auf zusätzliche Logik zu verzichten um abhängige Einträge zu lesen, diese sind stattdessen in einer Untertabelle gesammelt.

source: Full source code
de: Vollständiger Quellcode

source: The full module implementing the *simulation_input* reading
de: Die vollständige Modul-Implementierung des *simulation_input*

source: The auxilary module providing the error handler
de: Hilfsmodul um Fehlerbehandlung zu ermöglichen

source: Iterating over keys
de: Iterieren über Einträge

source: An expressive way to organize data is by providing a table where the keys of each entry describe the object that should be initialized. For example in a package manager the keys represent the dependency, where each dependency is declared in a subtable. Furthermore, a convenience feature might be the possibility to just provide a string, which is interpreted as a version subentry.
de: Eine klare Art Daten zu organisieren ist durch die Verwendung einer Tabelle in der die Einträge die Initialisierung der Objekte beschreiben. Zum Beispiel in einem Paketmanager beschreiben die Einträge die Abhängigkeiten, in der jede davon in einer Untertabelle deklariert wird. Zusätzlich kann der einfachheitshalber ein String angeben werden, der als Versions-Einschränkung für die Untertabelle interpretiert wird.

source: The final usage of this in a *requirements* table could look like the snippet shown below.
de: Die Implementierung in einer *requirements* Tabelle könnte wie folgt aussehen:

source: The first three entries provide a string value, while the forth entry provides a subtable implicitly by using dotted key-value pairs and the last entry uses an inline table.
de: In den ersten drei Einträgen wird ein String Wert verwendet, während der vierte Eintrag eine implizite Untertabelle über ein Punktgetrenntes Werte-Paar nutzt und der letzte Eintrag eine Inline-Tabelle ist.

source: Here we want to focus on the iteration and the default initialization, the internal structure of the *requirement_type* is secondary for this example. We provide the minimal definition only holding the name of the dependency for demonstration purposes.
de: Wir wollen uns hier auf die Iteration und die Standardinitialisierung konzentrieren. Die internen Struktur des *requirement_type* Datentype ist nebensächlich für dieses Beispiel. Daher geben wir für dieses Beispiel nur die minimale Definition an, die ausschließlich den Namen der Abhängigkeiten enthält.

source: For the actual implementation of reading all entries from the table we will use an one-dimensional array of *requirement_type* values. Using the ``get_keys`` method of the table we can obtain a list of all keys for the current table, the method will always allocate the ``list`` variable and we can safely allocate the *requirement_type* using the number of keys. To obtain the subtable, the ``get_value`` interface can be used, it will return a pointer to the subtable, either created implicitly by using a dotted key-value pair or by an inline table as shown in the snippet above. Finally, we can call the actual constructor of the *requirement_type* using the subtable references with the ``child`` pointer.
de: Für die Implementierung der Leseoperationen wird ein eindimensionales Feld von *requirement_type* Datentypen verwendet. Durch die ``get_keys`` Methode der Tabelle können alle Schlüssel der aktuellen Tabelle ermittelt werden. Die Methode wird immer eine allozierte ``list`` Variable zurückgeben und kann damit das *requirement_type* Feld auf die Anzahl der Schlüssel allozieren. Die ``get_value`` Methode kann verwendet werden, um auf die Untertabelle zuzugreifen. Sie wird einen Zeiger auf die Untertabelle zurückgeben, die entweder durch ein Punktgetrenntes Wert-Paar oder eine Inline-Tabelle erstellt wurde. Anschließend kann der Konstruktor des *requirement_type* Datentyps auf die Untertabelle-Referenzen mit dem ``child`` Zeiger aufgerufen werden.

source: The other scenario we want to support is the presence of a string rather than a subtable. In this case the ``get_value`` interface will fail, while it provides an optional status argument to check for successful operation, we can more conveniently and idomatically verify the success by checking the state of the ``child`` pointer. If there is no subtable to reference, *i.e.* because it is a key-value pair with a string entry, the ``child`` pointer will not be associated, which can be easily checked. For this case we will again use the ``get_value`` interface, but this time to retrieve the entry into a deferred length character. Again we can idomatically check the status of the operation using the allocation state of the variable and create the appropriate error message if needed. Eventually, we have to provide the constructor of the requirements with a table, for this purpose we create a dummy table and set the entry at the version key to the just retrieved string. The newly created dummy table can be associated with the ``child`` pointer and passed to the actual constructor.
de: Der zweite Scenario, das wir unterstützen, ist die Nutzung eines Strings anstatt einer Untertabelle. In diesem Fall wird die ``get_value`` Methode fehlschlagen, während ein optionaler Status-Parameter zurückgeben werden kann, um den Erfolg zu prüfen, können wir einfacher und idomatisch den Erfolg am Zuweisungs-Status des ``child`` Zeigers prüfen. Wenn es keine Untertabelle zu referenzieren gibt, weil es ein Wert-Paar mit einem String-Eintrag ist, wird der ``child`` Zeiger nicht zugewiesen. Dies kann einfach geprüft werden. Für diesen Fall werden wir die ``get_value`` Methode noch einmal verwenden, um den Eintrag in einen dynamischen String zu speichern. Auch hier können wir den Erfolg am Zuweisungs-Status prüfen und wenn ein Fehler aufgetreten ist, wird eine Fehlermeldung erzeugt. Anschließend können wir den Konstruktor des *requirement_type* Datentyps mit einer Dummy Tabelle aufrufen auf die wir mit dem ``child`` Zeiger referenziert haben.

source: The actual constructor for our example is very minimalistic and only recovers the name of the dependency which is passed as a separate argument.
de: Der eigentliche Konstruktor für dieses Beispiel ist sehr minimalistisch und spezifiziert nur den Namen der Abhängigkeit, welcher als separates Argument übergeben wird.

source: While we provide an error handler in the example, we also ensure that the allocation status of the *requirement_type* values communicates the status of the operation as well.
de: Wir bieten einen Fehlerbehandlungs-Prozess in diesem Beispiel, zusätzlich stellen wir sicher, dass der Zuweisungs-Status des *requirement_type* Feldes die Status-Informationen der Operation ebenfalls kommuniziert.

source: The full module implementing the *requirement_type* reading
de: Das vollständige Modul zum Einlesen des *requirement_type*

source: Array of tables
de: Feld von Tabellen

source: A special construct in TOML is the array of tables syntax, it provides a more verbose form to declare several tables in an array, which are usually provided using inline tables as shown below.
de: Ein spezielles Konstrukt in TOML ist ein Feld von Tabellen, das eine ausführlichere Form zum Deklarieren von mehreren Tabellen in einem Feld anbietet. Normalerweise wird dies durch Inline-Tabellen angegeben wie unten gezeigt.

source: Comparing the above example to the snippet below using an array of tables for the *tasks* array, the more verbose form becomes preferable in case further subtables are needed. Except for the subtables *config* the same data is provided.
de: Vergleichen wir das obige Beispiel mit dem unten gezeigten Beispiel für das *tasks* Feld, dann ist die ausführlichere Form bevorzugt, wenn wir weitere Untertabelle benötigen. In beiden Beispielen werden bis auf die *config* Untertabelle die gleichen Daten angegeben.

source: To represent this data we can use a single *task_config* derived type with a polymorphic *driver_config* member identifying the actual task. For this example we will have two implementations of such task such as LBFGS and Velocity Verlet, which are defined in the following snippets.
de: Um diese Daten zu repräsentieren können wir einen eigenen *task_config* Datentyp verwenden, welcher einen polymorphen *driver_config* Eintrag enthält, der die tatsächliche Aufgabe identifiziert. Für dieses Beispiel werden zwei Implementierungen wie LBFGS und Velocity Verlet definiert, welche in den folgenden Codeblöcken angegeben sind.

source: To read the array of tables we start from the root document and fetch the *tasks* entry as array using the ``get_value`` interface. The length of the whole arrays is known and we can use it to allocate the list of *task_config* values before reading the individual entries. The individual tables inside the array can addressed using the ``get_value`` interface by passing the (one-based) index.
de: Um das Feld von Tabellen zu einlesen starten wir vom Wurzeldokument und holen das *tasks* Eintrag als Feld mit der ``get_value`` Routine.Die Länge des gesamten Feldes ist bekannt und wir können diese Information benutzen, um eine Liste von *task_config* Einträgen zu allokieren. Die Tabellen in dem Feld können mit der ``get_value`` Routine anhand der (1-basierten) Indexposition abgefragt werden.

source: In the setup above, if the *tasks* entry is not present it will be implicitly created as an empty array. The allocation and the loop over the entries will work, however the consuming code should check whether no tasks are meaningful or should produce and error.
de: Im obigen Setup wird das *tasks* Eintrag implizit erzeugt, wenn dieser nicht vorhanden ist. Die Allokation und der Schleifendurchlauf funktionieren ohne Probleme, allerdings müssen die folgenden Routinen prüfen, ob eine Simulation ohne Aufgaben Sinn hat oder einen Fehler erzeugen.

source: To read the individual tasks we define a separate procedure to make it easily reusable and hide the fact that we are working with a subtable. To make the task *name* optional we make it default to the driver name, for *allocatable* or *pointer* variables the exit status of ``get_value`` can be easily checked by the allocation or association status of the respective variable, alternatively an integer variable can be passed to the optional *stat* argument. Finally, the configuration reader is called depending on the value of *driver* for ease of usage we use a block construct to allocate the specific type and than transfer it using *move_alloc* into the *task_config*.
de: Für die einzelnen Aufgaben definieren wir eine separate Routine, um das Auslesen von Untertabellen zu vereinfachen und die Logik zu verstecken, dass wir mit einer Untertabelle arbeiten. Für den *name* Eintrag ist der Defaultwert der Name des Treibers. Für *allocatable* oder *pointer* Variablen kann der Exit-Status der ``get_value`` Routine direkt überprüft werden. Alternativ kann ein Integerwert als optionales *stat* Argument übergeben werden. Anschließend wird eine weitere Lese-Routine abhängig von dem *driver* Eintrag aufgerufen. Dabei nutzen wir einen Block, um die spezifischen Typen zu allokieren und diese mit *move_alloc* in die *task_config* Instanz zu transferieren.

source: For reading the actual driver configuration we use the ``get_value`` interface to obtain the settings. We use the same defaulting mechanism as for the *name* entry here.
de: Für die eigentliche Treiber-Konfiguration nutzen wir die ``get_value`` Routine, um die Einstellungen zu lesen. Wir nutzen dieselbe Defaultwert Mechanismus wie für den *name* Eintrag hier.

source: Note that this example does not propagate back errors but directly calls *error stop*, for a more robust error reporting this can be changed by a small error handle or a context type.
de: Dieses Beispiel gibt keine Fehler zurück, sondern ruft direkt *error stop* auf, um eine robustere Fehlerbehandlung zu ermöglichen, kann dies durch einen kleineren Fehlerbehandlungs-Typ oder einen Kontexttyp implementiert werden.

source: The full module implementing the *task_config* reading
de: Die vollständige Modul-Implementierung um *task_config* zu lesen
