Repository: toml-f/toml-f
Catalog: doc/locales/*/LC_MESSAGES/how-to.po
Languages: de

source: This section contains practical guides for working with TOML Fortran. Each recipe is tailored for a specific problem and use case it is trying to solve.
de: Dieser Abschnitt enthält praktische Anleitungen für die Arbeit mit TOML Fortran. Jede Rezepte ist für eine bestimmte Problem- und Nutzungs-Szenarien angepasst.

source: Contributions are welcome!
de: Beiträge sind willkommen!

source: If you have written on TOML Fortran and want to contribute to the documentation, feel free to fork the repository and submit a pull request.
de: Wenn Du über TOML Fortran geschrieben hast und zur Dokumentation beigetreten möchtest, dann kannst Du das Repository forken und eine Pull Request öffnen.

source: Installing TOML Fortran
de: Installieren von TOML Fortran

source: This guide will walk you through installing the latest version of TOML Fortran. If you know your way around fpm, CMake or meson, checkout the :ref:`integration guide <integration>` to allow on-demand compilation of TOML Fortran as well as discovery of installed libraries.
de: Diese Anleitung führt Dich durch die Installation der neuesten Version von TOML Fortran. Falls Du FPM, CMake oder meson verwendest, schaue Dir die :ref:`Integrationsanleitung <integration>` an, um TOML Fortran automatisch in mitzukompilieren oder bereits installierte Bibliotheken zu finden.

source: :fab:`apple` :fab:`linux` :fab:`windows` Installing from conda-forge
de: :fab:`apple` :fab:`linux` :fab:`windows` Installation von conda-forge

source: This project is packaged for the *mamba* package manager and available on the *conda-forge* channel. To install the *mamba* package manager we recommend the `mambaforge <https://github.com/conda-forge/miniforge/releases>`_ installer. If the *conda-forge* channel is not yet enabled, add it to your channels with
de: Dieses Projekt ist für den *mamba*-Paketmanager verfügbar und wird auf dem *conda-forge*-Kanal zur Verfügung gestellt. Um den *mamba*-Paketmanager zu installieren, empfehlen wir den `mambaforge <https://github.com/conda-forge/miniforge/releases>`_-Installer. Falls der *conda-forge*-Kanal noch nicht aktiviert ist, füge ihn zu Deinen Kanälen hinzu mit

source: Once the *conda-forge* channel has been enabled, TOML Fortran can be installed with *mamba*:
de: Wenn der *conda-forge*-Kanal aktiviert ist, kann TOML Fortran mit *mamba* installiert werden:

source: It is possible to list all of the versions of TOML Fortran available on your platform with *mamba*:
de: Es ist möglich, alle verfügbaren Versionen von TOML Fortran für Dein System mit *mamba* aufzulisten:

source: A port for FreeBSD is available
de: Ein FreeBSD-Port ist verfügbar

source: In case no package is available build the port using
de: Falls kein Paket verfügbar ist, kann der Port folgendermaßen gebaut werden

source: For more information see the `toml-f port details <https://www.freshports.org/textproc/toml-f/>`_.
de: Für weitere Informationen schau Dir die `toml-f Port-Details <https://www.freshports.org/textproc/toml-f/>`_ an.

source: :fab:`linux` Using EasyBuild
de: :fab:`linux` Mit EasyBuild

source: :fab:`apple` Using Homebrew
de: :fab:`apple` Mit Homebrew

source: TOML Fortran is available in a custom tap at `grimme-lab/homebrew-qc <https://github.com/grimme-lab/homebrew-qc>`__ for the `brew <https://brew.sh>`_ package manager. You can include the tap by using
de: TOML Fortran ist in einem eigenen Tap unter `grimme-lab/homebrew-qc <https://github.com/grimme-lab/homebrew-qc>`__ für den `brew <https://brew.sh>`_-Paketmanager verfügbar. Du kannst den Tap mit dem `tap`-Kommando einbinden.

source: To build with a custom Fortran compiler you can set the ``FC`` environment variable and force to ignore preexisting binary distributions from the tap
de: Um mit einem eigenen Fortran-Compiler zu kompilieren, kannst Du die ``FC``-Umgebungsvariable setzen und die vorhandenen Binärdistributionsdateien vom Tap ignorieren

source: TOML Fortran has not yet been submitted to `homebrew-core <https://github.com/homebrew/homebrew-core>`_.
de: TOML Fortran wurde noch nicht zu `homebrew-core <https://github.com/homebrew/homebrew-core>`_ hinzugefügt.

source: Building from source
de: Vom Quellcode bauen

source: To build this project from the source code in this repository you need to have
de: Um dieses Projekt aus dem Quellcode in diesem Repository zu bauen, benötigst Du

source: a Fortran compiler supporting Fortran 2008
de: einen Fortran-Compiler, der Fortran 2008 unterstützt

source: GFortran 5 or newer
de: GFortran 5 oder neuer

source: Intel Fortran 18 or newer
de: Intel Fortran 18 oder neuer

source: NAG 7 or newer
de: NAG 7 oder neuer

source: One of the supported build systems
de: Eines der unterstützten Buildsysteme

source: `meson <https://mesonbuild.com>`_ version 0.55 or newer
de: `meson <https://mesonbuild.com>`_ Version 0.55 oder neuer

source: `CMake <https://cmake.org/>`_ version 3.9 or newer
de: `CMake <https://cmake.org/>`_ Version 3.9 oder neuer

source: First, get the source by cloning the repository
de: Erst, hol Dir den Quellcode per Clone des Repositories

source: Using Meson
de: Mit Meson

source: To build this project with meson a build-system backend is required, *i.e.* `ninja <https://ninja-build.org>`_ version 1.7 or newer. Setup a build with
de: Um dieses Projekt mit meson zu bauen, benötigst Du ein Build-System, wie `ninja <https://ninja-build.org>`_ Version 1.7 oder neuer.

source: You can select the Fortran compiler by the ``FC`` environment variable. To compile the project run
de: Du kannst den Fortran-Compiler durch die Umgebungsvariable ``FC`` auswählen. Um das Projekt zu kompilieren, rufe den folgenden Befehl auf

source: We employ a `validator suite <https://github.com/BurntSushi/toml-test>`_ to test the standard compliance of this implementation. To use this testing a *go* installation is required. The installation of the validator suite will be handled by meson automatically without installing into the users *go* workspace. Run the tests with
de: Wir arbeiten mit einer `Validator-Suite <https://github.com/BurntSushi/toml-test>`_ um die Standardkonformität dieser Implementierung zu testen. Um diese Test zu durchführen, benötigst Du eine *go*-Installation. Die Installation der Validator-Suite wird automatisch von meson in den *go*-Arbeitsbereich eingebunden. Die Tests werden folgendermaßen aufgerufen

source: To run the full decoder test add the benchmark argument. This test will currently fail, due to the implementation not yet supporting Unicode escape sequences.
de: Um den kompletten Decoder-Test auszuführen, füge den Benchmark-Parameter hinzu. Dieser Test wird zur Zeit fehlschlagen, da die Implementierung noch Unicode-Escape-Sequenzen nicht unterstützt.

source: The binary used for transcribing the TOML documents to the testing format is ``_build/test/toml2json`` and can be used to check on per test basis. Finally, you can install TOML Fortran with
de: Das Programm zum Transkribieren von TOML-Dokumenten in das Testformat ist ``_build/test/toml2json`` und kann zur Prüfung auf Basis der Tests verwendet werden. Zum Abschluss kann TOML Fortran wie folgt installiert werden

source: Using CMake
de: Mit CMake

source: While meson is the preferred way to build this project it also offers CMake support. Configure the CMake build with
de: Während meson die bevorzugte Bauweise für dieses Projekt ist, bietet es auch CMake-Unterstützung. Konfiguriere den CMake-Build mit

source: Similar to meson the compiler can be selected with the ``FC`` environment variable. You can build the project using
de: Ähnlich wie meson kann der Compiler durch die Umgebungsvariable ``FC`` ausgewählt werden. Du kannst das Projekt wie folgt bauen

source: Supported compilers
de: Unterstützte Compiler

source: This is a non-comprehensive list of tested compilers for TOML Fortran. Compilers with the label *latest* are tested with continuous integration for each commit.
de: Dies ist eine nicht-komplettierte Liste von getesteten Compilern für TOML Fortran. Compiler mit dem Label *latest* werden getestet mit den kontinuierlichen Integrationen für jeden Commit.

source: Platform
de: Plattform

source: Architecture
de: Architektur

source: Compiler known to fail are documented here, together with the last commit where this behaviour was encountered. If available an issue in on the projects issue tracker or the issue tracker of the dependencies is linked. Usually, it safe to assume that older versions of the same compiler will fail to compile as well and this failure is consistent over platforms and/or architectures.
de: Compiler die aktuell fehlschlagen sind hier dokumentiert, zusammen mit dem letzten Commit, an dem dieses Verhalten aufgetreten ist. Wenn verfügbar ist ein Problem im Issue-Tracker des Projekts oder der Issue-Tracker der Abhängigkeiten verlinkt. Normalerweise ist es sicher, dass ältere Versionen desselben Compilers auch fehlschlagen und dieses Verhalten ist über Platformen und/oder Architekturen konsistent.

source: Reference
de: Referenz

source: Using TOML Fortran
de: TOML Fortran verwenden

source: This tutorial shows how to integrate the TOML Fortran library with your build system and use it easily in your project.
de: Dieses Tutorial zeigt, wie sich die TOML Fortran-Bibliothek mit Deinem Build-System integrieren kannst und sie einfach in Dein Projekt verwendest.

source: Using the Fortran package manager
de: Mit dem Fortran-Paket-Manager verwenden

source: The Fortran package manager (`fpm <https://fpm.fortran-lang.org>`_) is a tool for building Fortran projects and managing dependencies on Fortran libraries. To enable TOML Fortran in your fpm project add the following entry to your package manifest:
de: Der Fortran-Paket-Manager (`fpm <https://fpm.fortran-lang.org/de>`_) ist ein Werkzeug zum Erstellen von Fortran-Projekten und Verwaltung von Abhängigkeiten von Fortran-Bibliotheken. Um TOML Fortran in Deinem fpm-Projekt zu aktivieren, füge folgenden Eintrag in Deinen Paket-Manifest ein:

source: When building your project fpm will automatically fetch TOML Fortran for you and build it as part of your project. The TOML Fortran modules become useable in your project.
de: Wenn Du Dein Projekt baust, wird fpm automatisch TOML Fortran für Dich herunterladen und als Teil Deines Projekts kompilieren. Die TOML Fortran-Module werden in Deinem Projekt dann verfügbar gemacht.

source: Integrate with meson
de: Mit meson integrieren

source: To allow meson to use TOML Fortran it is easiest to include it as subproject using a git wrap file placed in the ``subprojects`` directory.
de: Um TOML Fortran in meson zu verwenden, ist es am einfachsten, wenn Du es als Unterprojekt mit einer git-Wrap-Datei im ``subprojects``-Verzeichnis einbindest.

source: The revision can be adjusted to pin a specific release tag of TOML Fortran for additional stability. In the projects meson buid file the dependency method can be used to access TOML Fortran using the wrap file to define a fallback which is built on-demand.
de: Die Revision kann angepasst werden, um eine bestimmte Release-Tag von TOML Fortran festzulegen und die Stabilität zu erhöhen. In den Meson Build-Dateien kannst Du dann TOML Fortran als Abhängigkeit verwenden, dank der Wrap-Datei, wird eine Fallback-Version definiert und TOML Fortran kann bei Bedarf mitzukompiliert werden.

source: Finally, you can add ``tomlf_dep`` as dependency to any of your targets and are done.
de: Damit kannst Du ``tomlf_dep`` als Abhängigkeit zu einem beliebigen Ziel hinzufügen und bist fertig.

source: Integrate with CMake
de: Mit CMake integrieren

source: To use TOML Fortran in CMake based projects it is useful to define your own find-module, to allow on-demand compilation of TOML Fortran as well as discovery of installed packages from both meson and CMake based builds.
de: Um TOML Fortran in CMake-basierten Projekten zu verwenden, ist es nützlich, ein eigenes find-Modul zu definieren, um TOML Fortran entweder bei Bedarf mitzukompiliert oder auch die Installation von installierten Paketen von sowohl meson als auch CMake-basierten Builds zu ermöglichen.

source: In your main CMake build file you have to include the custom find-module in your ``CMAKE_MODULE_PATH``, afterwards you can just use ``find_package`` to obtain the ``toml-f::toml-f`` target and link against it.
de: In Deiner primären CMake-Build Datei musst Du das eigene find-Modul in Deinem ``CMAKE_MODULE_PATH`` einbinden, danach kannst Du ``find_package`` verwenden, um das ``toml-f::toml-f``-Ziel zu erhalten und dagegen zu verlinken.

source: Note that we also install the find-modules, this is important if you want to make your CMake projects reusable in the same way TOML Fortran can be used in your project. Finally we need some boilerplate to define the custom find-module is documented below.
de: Beachte, dass wir auch die find-Module installieren, das ist wichtig, wenn Du Deine CMake-Projekte in der gleichen Weise wie TOML Fortran in anderen Projekt verwenden kannst. Zuletzt brauchst Du ein paar Zeilen Code, um das eigene find-Modul zu definieren, siehe unten.

source: Imported Targets
de: Importierte Ziele

source: This module provides the following imported target, if found:
de: Dieses Modul stellt folgende importierte Ziele bereit, falls es gefunden wurde:

source: The toml-f library
de: Die toml-f Bibliothek

source: Result Variables
de: Ergebnisvariablen

source: This module will define the following variables:
de: Dieses Modul definiert folgende Variablen:

source: True if the toml-f library is available
de: Wahr wenn die toml-f Bibliothek verfügbar ist

source: Path to the source directory of the toml-f project, only set if the project is included as source.
de: Pfad zum Quellverzeichnis des toml-f Projekts, nur gesetzt, wenn das Projekt als Quellcode eingebunden wird.

source: Path to the binary directory of the toml-f project, only set if the project is included as source.
de: Pfad zum Buildverzeichnis des toml-f Projekts, nur gesetzt, wenn das Projekt als Quellcode eingebunden wird.

source: Cache variables
de: Cachevariablen

source: The following cache variables may be set to influence the library detection:
de: Die folgenden Cachevariablen können gesetzt werden um die Einbindung der Bibliothek zu beeinflussen:

source: Methods to find or make the project available. Available methods are
de: Möglichkeiten zum Finden oder zum Erstellen des Projekts. Verfügbar sind

source: ``cmake``: Try to find via CMake config file
de: ``cmake``: Versuche via CMake Konfigurationsdatei zu finden

source: ``pkgconf``: Try to find via pkg-config file
de: ``pkgconf``: Versuche via pkg-config Datei zu finden

source: ``subproject``: Use source in subprojects directory
de: ``subproject``: Verwende Quellcode in Unterprojektverzeichnis

source: ``fetch``: Fetch the source from upstream
de: ``fetch``: Hole den Quellcode vom Upstream Repository

source: Used for searching the CMake config file
de: Wird für die Suche der CMake Konfigurationsdatei verwendet

source: Directory to find the toml-f subproject, relative to the project root
de: Verzeichnis zum Finden des toml-f Unterprojekts, relativ zum Projekt Wurzelverzeichnis

source: Other build systems
de: Andere Buildsysteme

source: Other build systems must discover a precompiled TOML Fortran library from the system. For this purpose the ``pkg-config`` tool is used. After installing TOML Fortran with either meson or CMake a pc-file is generated which can be discovered by ``pkg-config`` and describes how to compile against the installed module files as well as link against the TOML Fortran library. First check if the ``pkg-config`` tool is available and can discover TOML Fortran
de: Andere Buildsysteme müssen eine vorkompilierte TOML Fortran Bibliothek auf dem System finden und nutzen. Dazu wird das ``pkg-config`` Tool verwendet. Nach der Installation von TOML Fortran mit Meson oder CMake wird eine pc-Datei erzeugt, die von ``pkg-config`` gefunden werden kann und beschreibt, wie gegen die installierten Moduldateien kompiliert werden kann und wie sich die TOML Fortran Bibliothek verlinken lässt.Zunächst prüfe, ob das ``pkg-config`` Tool verfügbar ist und TOML Fortran gefunden werden kann.

source: Make sure to adjust the ``PKG_CONFIG_PATH`` environment variable to point to the correct installation directory. Using the ``--libs`` and ``--cflags`` options the libraries to link against as well as the include directories can be obtained:
de: Stelle sicher, dass die Umgebungsvariable ``PKG_CONFIG_PATH`` auf das richtige Installationsverzeichnis zeigt. Mit den ``--libs`` und ``--cflags`` Optionen können die Bibliotheken, die verlinkt werden sollen, und die Include-Verzeichnisse erhalten werden:

source: In a handwritten Makefile those can be included by
de: In einem handgeschriebenen Makefile können diese wie folgt genutzt werden

source: Serializable base class
de: Serialisierbare Basisklasse

source: This recipe shows how to create a serializable class based on TOML Fortran. Currently, TOML Fortran does not define such a base class itself, therefore we define a loader and dumper interface for turning a file or connected unit into a data structure. The abstract base class will implement the processing of the file or unit to a TOML data structure and pass it to a deferred procedure which the implementing class uses to define its mapping from and back to the TOML data structure. This way an easily round-tripable data structure can be created and used in a variety of contexts.
de: Dieses Rezept zeigt, wie eine serialisierbare Klasse auf TOML Fortran basierend konstruiert werden kann. Momentan ist TOML Fortran selbst keine Klasse als Basis für eine serialisierbare Klasse, daher werden wir eine Loader- und Dumper-Schnittstelle definieren, um eine Datei oder eine verbundene Unit in eine Datenstruktur zu konvertieren. Die abstrakte Basisklasse implementiert die Verarbeitung der Datei oder der Unit in eine TOML Datenstruktur und leitet diese an eine deferred Prozedur weiter, die in der Klasse implementiert wird um, ein Mapping von der TOML Datenstruktur and zurück zu definieren. Diese Art von Datenstruktur kann in verschiedenen Kontexten genutzt werden and einfach in TOML und zurück transferiert werden.

source: TOML Fortran might provide such abstract base class in the future natively.
de: TOML Fortran könnte in Zukunft selbst eine solche abstrakte Basisklasse bereitstellen.

source: The base class can be defined as
de: Die Basisklasse kann wie folgt definiert werden

source: We also define a convenience error handler which holds the error message and signals its error status by its allocation state.
de: Wir definieren auch einen Fehler-Handler, der die Fehlermeldung speichert und den Fehlerstatus durch seinen Allokationstatus signalisiert.

source: An example for a serializable class based on the above base class is given below.
de: Ein Beispiel für eine serialisierbare Klasse basierend auf der oben gegebenen Basisklasse ist unten aufgeführt.

source: The defined data class can in an application easily be loaded from a file, while the actual implementation does not have to deal with getting the TOML data structure from the file but can assume that if the configuration file was valid TOML it will be provided with a data structure to read from.
de: Die definierte Datenklasse kann in einer Anwendung einfach aus einer Datei geladen werden, während die tatsächliche Implementierung sich nicht um das Lesen der TOML Datenstruktur kümmert, sondern kann sich auch darauf verlassen, dass wenn die Konfigurationsdatei gültiges TOML war, eine Datenstruktur zum Lesen bereitsteht.

source: Working with tables
de: Mit Tabellen zu arbeiten

source: The central data structure in TOML are tables, they contain a map from a key (string) to any supported data type in TOML. This recipes describe common scenarios for retrieving data from tables using the TOML Fortran library.
de: Die zentrale Datenstruktur in TOML sind Tabellen, sie enthalten eine Zuordnung von Einträgen (String) zu allen unterstützten Datentypen in TOML. Dieses Rezept beschreibt die allgemeinen Szenarien für das Abfragen von Daten aus Tabellen mit der TOML Fortran-Bibliothek.

source: Accessing nested tables
de: Geschachtelte Tabellen abfragen

source: Using nested tables provides the possibility to better group configuration data. Since the TOML format always requires the full qualified path in each table header, it is easy for the user to identify where the current settings belong to. On the other hand deeply nested tables with long table paths or path components make it more difficult to use and a good balance of short and expressive table names and meaningful subtables is required.
de: Geschachtelte Tabellen ermöglichen es, Konfigurationsdaten besser zu gruppieren. Da das TOML-Format immer den vollständigen Pfad in jeder Tabellenkopfangabe erfordert, ist es einfach für den Benutzer zu erkennen, wo die aktuellen Einstellungen zu finden sind. Aber schwieriger wird es wenn tief geschachtelte Tabellen mit langen Tabellenpfaden oder Pfadkomponenten verwendet werden. Eine gute Balance zwischen kurzen und aussagekräftigen Tabellennamen und Untereinträge ist erforderlich.

source: An example for an electronic structure code implementing different Hamiltonians is give below.
de: Ein Beispiel für einen elektronischen Strukturcode, der unterschiedlicheHamiltonians implementiert, ist unten aufgeführt.

source: The deepest nested subtable with entries in this example is the *hamiltonian.dftb.skf* path.
de: Die tiefste geschachtelte Untertabelle in diesem Beispiel ist der *hamiltonian.dftb.skf* Pfad.

source: Such layout in the configuration file will usually be mirrored in the actual implementation, with every table corresponding to a derived type describing the input. For the example above in total six derived types for the individual tables are defined as
de: Dieser Aufbau in der Konfigurationsdatei wird in der tatsächlichen Implementierung korrespondierend wiedergeben, wobei jede Tabelle entsprechend einen abgeleiteten Typ beschreibt, der der Eingabe entspricht. Für das Beispiel oben sind insgesamt sechs abgeleitete Typen für die einzelnen Tabellen definiert.

source: The representation in Fortran derived types looks lengthy compared to the actual TOML input. Consider that the 40 lines of Fortran code contain 50% comments describing the data types briefly for (future) developers. Of course, the user documentation of the input format will be much more extensive, containing descriptions for every table and every entry, including input ranges and unit conventions. The final input file provided by the user can be brief and expressive.
de: Die Darstellung in abgeleiteten Typen ist in Fortran länger als die TOML-Eingabe. Dabei sollte beachten werden, dass die 40 Zeilen von Fortran Code 50% Kommentare enthalten, die die Datentypen für (zukünftige) Entwickler beschreiben. Zudem ist die Benutzerdokumentation des Eingabeformats ähnlich ausführlich, mit Beschreibungen für alle Tabellen und Einträge, inklusive Eingabebereichs und Einheiten. Die Eingabedatei kann dann kurz und aussagekräftig sein.
