Repository: toml-f/toml-f
Catalog: doc/locales/*/LC_MESSAGES/index.po
Languages: de

source: References
de: Referenzen

source: TOML Fortran library
de: TOML Fortran Bibliothek

source: License
de: Lizenz

source: API docs
de: API Dokumentation

source: Documentation Status
de: Dokumentationsstatus

source: This project provides a library to work with `TOML <https://toml.io>`_ files and data structures and allows to define data serialization and deserialization in Fortran. The currently supported TOML standard is `version 1.0.0 <https://toml.io/en/v1.0.0>`__. The TOML Fortran project is hosted at GitHub at `toml-f/toml-f <https://github.com/toml-f/toml-f>`__.
de: Dieses Projekt stellt eine Bibliothek um mit `TOML <https://toml.io>`_ Dokumenten zu arbeiten, Datenstrukturen zu definieren und diese mit Fortran zu serialisieren und zu deserialisieren. Derzeit wird der `TOML Standard in Version 1.0.0 <https://toml.io/en/v1.0.0>`__ unterstützt. Das TOML Fortran Projekt ist auf GitHub unter `toml-f/toml-f <https://github.com/toml-f/toml-f>`__ gehostet.

source: Guides and courses for using TOML with complete and self-contained examples.
de: Anleitungen und Kurse zur Verwendung von TOML mit kompletten und eigenständigen Beispielen.

source: :octicon:`book` Recipes
de: :octicon:`book` Rezepte

source: Examples and recipes for solving common tasks with TOML Fortran.
de: Beispiele und Rezepte für die häufigsten Aufgaben mit TOML Fortran.

source: :octicon:`gear` Reference
de: :octicon:`gear` Referenz

source: Generated documentation of all procedures and derived types available.
de: Dokumentation aller Prozeduren und abgeleiteten Typen.

source: Instructions for installing, updating or compiling TOML Fortran.
de: Anleitungen zur Installation, Aktualisierung oder Kompilierung von TOML Fortran.

source: GitHub repository for the development of TOML Fortran.
de: GitHub Repository für die Entwicklung von TOML Fortran.

source: :octicon:`link` External
de: :octicon:`link` Extern

source: External links to other resources, blogs, etc.
de: Externe Links zu anderen Ressourcen, Blogs, etc.

source: TOML Fortran is used for example in the Fortran package manager (`fpm <https://fpm.fortran-lang.org>`_), a typical package manifest specified in TOML is shown below
de: TOML Fortran wird zum Beispiel in dem Fortran Paketmanager (`fpm <https://fpm.fortran-lang.org/de/>`_) verwendet, ein typisches Paketmanifest in TOML wird unten angezeigt
