Repository: toml-f/toml-f
Catalog: doc/locales/*/LC_MESSAGES/tutorial.po
Languages: de

source: Getting started
de: Einführung

source: This tutorial provides a gentle introduction to the use of TOML Fortran. It will deal with reading as well as creating TOML data structures using the high-level build interface and discuss how to obtain a data structure from a TOML document or turn a data structure to TOML document again.
de: Dieses Tutorial bietet eine einfache Einführung in die Benutzung von TOML Fortran. Das Lesen und Schreiben von TOML Datenstrukturen wird behandelt, sowie die Erstellung von Datenstrukturen aus TOML Dokumenten außerdem wird diskutiert wie eine Datenstruktur aus einem TOML Dokument erstellt wird oder wieder in ein TOML Dokument konvertiert wird.

source: For this project we will be working with fpm, however you can use any build tool you are familar with, checkout the :ref:`integration guide <integration>` to find a matching setup. We start with creating a minimal package manifest to use TOML Fortran in our fpm project.
de: Für dieses Projekt werden wir mit fpm arbeiten, aber Du kannst jedes Build-Tool verwenden, mit dem Du dich gut zurecht kommst, schau Dir die :ref:`Integrations-Anleitung <integration>` an, um einen passenden Setup zu finden. Wir starten mit der Erstellung eines minimalen Paketmanifests, um TOML Fortran in unserem fpm Projekt zu benutzen.

source: The public TOML Fortran API is defined in the ``tomlf`` module, we will only use this module for this entire course. The main data structures we are going to interact with are ``toml_table`` and ``toml_array`` instances, which we can conveniently manipulate with the generic interface ``get_value``.
de: Die öffentliche TOML Fortran API wird in dem Modul ``tomlf`` definiert, und wir werden nur dieses Modul für diesen gesamten Kurs brauchen. Die Hauptdatenstruktur, mit der wir uns in diesem Kurs konkret kommunizieren wird ``toml_table`` und ``toml_array`` Instanzen, die wir mit dem generischen interface ``get_value`` manipulieren können.

source: Note that we declare the TOML data structure as mutable, *i.e.* ``intent(inout)`` rather than just ``intent(in)``, as the ``get_value`` interface can modify the data structure. We start with a simple test program which is not actually reading any TOML document, but just passing an empty table to our reader.
de: Hinweis: Wir deklarieren die TOML Datenstruktur als mutable, *d.h.* ``intent(inout)`` statt nur ``intent(in)``, da das ``get_value`` interface die Datenstruktur verändern kann. Wir beginnen mit einem einfachen Testprogramm, welches nicht einmal ein TOML Dokument liest, sondern nur eine leere Tabelle an den Reader weitergeben.

source: The ``get_value`` interface for processing the TOML data structure ensures that the data structure is complete throughout the whole process of reading it and will add the requested nodes if there are not present or will fill them in with default values. Convince yourself that the empty table indeed changed while reading by passing a serializer to it.
de: Das ``get_value`` interface für die Verarbeitung der TOML Datenstruktur stellt sicher, dass die Datenstruktur vollständig durch den gesamten Prozess gelesen wird und fügt die gewünschten Knoten hinzu, wenn sie nicht vorhanden sind oder füllt sie mit Standardwerten aus. Überzeuge Dich, dass die leere Tabelle während des Lesens wirklich geändert wurde, indem Du einen Serializer an die Datenstruktur übergibst.

source: This behavior is very convenient because it allows us to define our default values while defining how we read the TOML data structure.
de: Dieses Verhalten ist sehr einfach, da wir unsere Standardwerte definieren können, während wir definieren, wie wir die TOML Datenstruktur lesen.

source: The ``get_value`` build interface is only one way of accessing the TOML data structure provided by TOML Fortran. It takes an opinionated approach towards reading and modifying the data structure, which is suitable the majority of applications.
de: Das ``get_value`` build interface ist nur eine der Möglichkeiten, um auf die TOML Datenstruktur mit TOML Fortran zuzugreifen. Es nimmt eine opionierten Ansicht auf, wie die Datenstruktur gelesen und verändert werden soll, was für einen Großteil der Anwendungen funktioniert.

source: Now we will actually read a TOML document and pass it to our reader.
de: Wir lesen jetzt ein echtes TOML Dokument und übergeben es an den Reader.

source: We adapt our command line driver to read the file ``input.toml`` and output the values as before
de: Wir adaptieren unseren Befehlszeilen-Driver, um die Datei ``input.toml`` zu lesen und die Werte wie vorher auszugeben.

source: Running the program with fpm shows that we were able to read the correct values from the document
de: Durch das Ausführen des Programms mit fpm kannst Du sehen, dass wir die korrekten Werte aus dem Dokument gelesen haben.

source: You can again use the serializer to write the final data structure, if you want to check whether the ``get_value`` interface has added default values.
de: Du kannst das Serializer noch einmal verwenden, um die finale Datenstruktur zu schreiben, wenn Du möchtest, ob das ``get_value`` interface Standardwerte hinzugefügt hat.

source: In this tutorial you have learned out to read simple data structures from TOML documents. You can now
de: In diesem Tutorial hast Du gelernt, einfache Datenstrukturen aus TOML Dokumenten zu lesen. Du kannst nun

source: define the logic to read data from TOML structures
de: die Logik zum Lesen von Daten aus TOML Strukturen definieren

source: provide default values in your parser as you define the input structure
de: Standardwerte in Deinen Parsern definieren, wenn Du die Eingabestruktur definierst

source: read an actual TOML document from a file
de: ein echtes TOML Dokument aus einer Datei lesen

source: write TOML documents from your data structures
de: aus Deinen Datenstrukturen TOML Dokumente schreiben

source: Tutorial courses
de: Tutorial Kurse

source: This section contains self-contained courses teaching the usage of TOML Fortran. Each tutorial is a full example for a specific application covering several aspects of the library.
de: Dieser Abschnitt enthält eine Reihe von Kursen, die Dich durch die Benutzung von TOML Fortran leiten. Jedes Tutorial ist ein vollständiges Beispiel für eine bestimmte Anwendung, die mehrere Aspekte der Bibliothek abdeckt.

source: Contributions are welcome!
de: Beiträge sind willkommen!

source: If you have written on TOML Fortran and want to contribute to the documentation, feel free to fork the repository and submit a pull request.
de: Wenn Du zu TOML Fortran geschrieben hast und zur Dokumentation beitragen willst, kannst Du gerne das Repository forken und einen Pull Request öffen.
